1c_um/src/Reports/ум_АнализМногопоточнойОбработки/ум_АнализМногопоточнойОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ум_АнализМногопоточнойОбработки</name>
</mdclass:Report>

1c_um/src/InformationRegisters/ум_ЛогФоновыхЗаданийПакетов/ум_ЛогФоновыхЗаданийПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЛогФоновыхЗаданийПакетов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ум_ВидыФЗПакетовДанных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРодительскогоФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ум_ЛогированиеСобытийФЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_ВидыФЗПакетовДанных/ум_ВидыФЗПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_ВидыФЗПакетовДанных</name>
  <enumValues>
    <name>РегламентноеЗаданиеОбработкаПакетов</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеКонтрольРабочихФЗ</name>
  </enumValues>
  <enumValues>
    <name>УпровляющееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РабочееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеОбслуживаниеСистемы</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Enums/ум_ЛогированиеСобытийФЗ/ум_ЛогированиеСобытийФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_ЛогированиеСобытийФЗ</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Окончание</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Reports/ум_АнализМногопоточнойОбработки/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
    
    ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПериода", ЭтотОбъект);
    Диалог = Новый ДиалогРедактированияСтандартногоПериода;   
    Диалог.Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
    Диалог.Показать(ОписаниеВыбора);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборПериода(ВыбранныйПериод, ДополнительныеПараметры = Неопределено) Экспорт
    
    Если ВыбранныйПериод <> Неопределено Тогда
        НачалоПериода = ВыбранныйПериод.ДатаНачала;
        КонецПериода  = ВыбранныйПериод.ДатаОкончания;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Диаграмма = ЭтотОбъект.Диаграмма;
    ОчиститьИНастроитьДиаграмму(Диаграмма);
    
    СерияРабочее = Диаграмма.УстановитьСерию("Рабочие потоки");
    СерияРабочее.Цвет = WebЦвета.СинийСПороховымОттенком;
    
    СерияУправляющее = Диаграмма.УстановитьСерию("Управляющее ФЗ");
    СерияУправляющее.Цвет = WebЦвета.СинийСоСтальнымОттенком;

    ТаблицаДанных = ДанныеДляДиаграммы();
    
    МинДатаГанта = Неопределено;
    МаксДатаГанта = 0;
    
    КэшОкончанийДорожек    = Новый Соответствие;
    КэшТочекУправляющих    = Новый Соответствие;
    КэшСпособов            = Новый Соответствие;
    КэшЧетныхУправляющихФЗ = Новый Соответствие;
    
    ВидРабочее     = Перечисления.ум_ВидыФЗПакетовДанных.РабочееФЗ;
    ВидУправляющее = Перечисления.ум_ВидыФЗПакетовДанных.УпровляющееФЗ;
    
    СтрокиУправляющих = ТаблицаДанных.НайтиСтроки(Новый Структура("ВидФЗ", ВидУправляющее)); 
    СчетчикУправляющих = 0;
    
    Для Каждого СтрокаУправляющего Из СтрокиУправляющих Цикл
        
        ДатаОкончания = 0;
        ОбновитьГраницыВремени(СтрокаУправляющего, МинДатаГанта, МаксДатаГанта, ДатаОкончания);
        ИмяСпособа = СтрокаУправляющего.СпособОбработкиПакетовПредставление;
       
        ИмяУправляющего = ИмяСпособа + " (Управляющее ФЗ)"; 
		ИДСпособаОбработки = XmlСтрока(СтрокаУправляющего.СпособОбработки);

        ТочкаУправл = Диаграмма.УстановитьТочку(ИДСпособаОбработки);   
        ТочкаУправл.Текст = ИмяУправляющего;
        КэшТочекУправляющих.Вставить(СтрокаУправляющего.КлючРабочегоПотока, ТочкаУправл);
        
        СчетчикУправляющих = СчетчикУправляющих + 1;
        Если СчетчикУправляющих % 2 = 0 Тогда
            КэшЧетныхУправляющихФЗ.Вставить(СтрокаУправляющего.КлючРабочегоПотока, Истина);
        КонецЕсли;

        ЦветИнтервала = ?(СчетчикУправляющих % 2 = 0, WebЦвета.ЗеленыйЛес, Неопределено);  
		Текст = СтрокаУправляющего.ОбработаноПакетов;
        ДобавитьИнтервалДиаграммы(Диаграмма, ТочкаУправл, СерияУправляющее, СтрокаУправляющего.ВременнаяМеткаНачало, ДатаОкончания, ЦветИнтервала, Текст);
        
    КонецЦикла;
	
    СтрокиРабочих = ТаблицаДанных.НайтиСтроки(Новый Структура("ВидФЗ", ВидРабочее));
    
    Для Каждого СтрокаРабочего Из СтрокиРабочих Цикл
        
        ДатаОкончания = 0;
        ОбновитьГраницыВремени(СтрокаРабочего, МинДатаГанта, МаксДатаГанта, ДатаОкончания);
        ИмяСпособа = СтрокаРабочего.СпособОбработкиПакетовПредставление;
        ИДСпособаОбработки = XmlСтрока(СтрокаРабочего.СпособОбработки);
        ТочкаРодитель = КэшТочекУправляющих.Получить(СтрокаРабочего.ИдентификаторРодительскогоФЗ);
        Если ТочкаРодитель = Неопределено Тогда
            ТочкаРодитель = ПолучитьИлиСоздатьТочкуСпособа(Диаграмма, КэшСпособов, ИмяСпособа);
        КонецЕсли;
        
        НомерДорожки = ОпределитьНомерДорожки(КэшОкончанийДорожек, СтрокаРабочего.СпособОбработки, СтрокаРабочего.ВременнаяМеткаНачало, ДатаОкончания);
        
        ТочкаДорожка = Диаграмма.УстановитьТочку(СтрокаРабочего.СпособОбработки, ТочкаРодитель.Значение);
        ТочкаДорожка.Текст = ИмяСпособа;
		СерияДорожка = Диаграмма.УстановитьСерию(ИДСпособаОбработки + " " + НомерДорожки); 
		СерияДорожка.Текст = Строка(НомерДорожки);
        
        ЦветИнтервала = ?(КэшЧетныхУправляющихФЗ.Получить(СтрокаРабочего.ИдентификаторРодительскогоФЗ) <> Неопределено, WebЦвета.ЗеленаяЛужайка, WebЦвета.СинийСПороховымОттенком);
        ТекстИнтервала = СтрокаРабочего.ОбработаноПакетов;
        
        ДобавитьИнтервалДиаграммы(Диаграмма, ТочкаДорожка, СерияДорожка, СтрокаРабочего.ВременнаяМеткаНачало, ДатаОкончания, ЦветИнтервала, ТекстИнтервала);
        
    КонецЦикла;
    
    Если МинДатаГанта <> Неопределено Тогда 
        Диаграмма.УстановитьПолныйИнтервал(ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МинДатаГанта) - 10, ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МаксДатаГанта) + 10);
    КонецЕсли;
    
    Диаграмма.Обновление = Истина;
    
КонецПроцедуры

&НаСервере
Процедура ОчиститьИНастроитьДиаграмму(Диаграмма)
    
    Диаграмма.Очистить();
    Диаграмма.Обновление = Ложь;
    
    Диаграмма.АвтоУстановкаТекстаСерий = Ложь;
    Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
    Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;
    Диаграмма.ОтображатьПустыеЗначения = Ложь;
    Диаграмма.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Градиент;
    Диаграмма.ОтображатьЛегенду = Ложь; 
    Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
    
    Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы;
    Пока Шкала.Количество() > 1 Цикл
        Шкала.Удалить(Шкала[1]);
    КонецЦикла;
    
    ЭлементЧасы = Шкала.Добавить();
    ЭлементЧасы.Единица = ТипЕдиницыШкалыВремени.Час;
    ЭлементЧасы.Кратность = 1;
    
    ЭлементМинуты = Шкала.Добавить();
    ЭлементМинуты.Единица = ТипЕдиницыШкалыВремени.Минута;
    ЭлементМинуты.Кратность = 1;
    
    ЭлементСекунды = Шкала.Добавить();
    ЭлементСекунды.Единица = ТипЕдиницыШкалыВремени.Секунда;
    ЭлементСекунды.Кратность = 1; 
    
КонецПроцедуры

&НаСервере
Функция ДанныеДляДиаграммы()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	ЛогФЗ.ИдентификаторФЗ КАК КлючРабочегоПотока,
        |	ЛогФЗ.Вид КАК ВидФЗ,
        |	МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) КАК ВременнаяМеткаНачало,
        |	ВЫБОР
        |		КОГДА МИНИМУМ(ЛогФЗ.ВременнаяМеткаСобытия) = МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия)
        |			ТОГДА &ТекущееВремяВМиллисекундах
        |		ИНАЧЕ МАКСИМУМ(ЛогФЗ.ВременнаяМеткаСобытия)
        |	КОНЕЦ КАК ВременнаяМеткаКонец,
        |	ЛогФЗ.СпособОбработкиПакетов КАК СпособОбработки,
        |	ЛогФЗ.ИдентификаторРодительскогоФЗ КАК ИдентификаторРодительскогоФЗ,
        |	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
        |				КОГДА ЛогФЗ.Событие = ЗНАЧЕНИЕ(Перечисление.ум_ЛогированиеСобытийФЗ.Окончание)
        |					ТОГДА ЛогФЗ.ДанныеСобытия
        |				ИНАЧЕ """"
        |			КОНЕЦ КАК СТРОКА(50))) КАК ДанныеСобытия,
        |	ЛогФЗ.СпособОбработкиПакетов.Представление КАК СпособОбработкиПакетовПредставление
        |ИЗ
        |	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ЛогФЗ
        |ГДЕ
        |	ЛогФЗ.Вид В (ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.РабочееФЗ), ЗНАЧЕНИЕ(Перечисление.ум_ВидыФЗПакетовДанных.УпровляющееФЗ))
        |	И (&ОтключитьОтборПоНачалу
        |			ИЛИ ЛогФЗ.ВременнаяМеткаСобытия >= &МеткаНачала)
        |	И (&ОтключитьОтборПоОкончанию
        |			ИЛИ ЛогФЗ.ВременнаяМеткаСобытия <= &МеткаОкончания)
        |	И (&ОтключитьОтборПоСпособу
        |			ИЛИ ЛогФЗ.СпособОбработкиПакетов = &СпособОбработки)
        |
        |СГРУППИРОВАТЬ ПО
        |	ЛогФЗ.ИдентификаторФЗ,
        |	ЛогФЗ.Вид,
        |	ЛогФЗ.СпособОбработкиПакетов,
        |	ЛогФЗ.ИдентификаторРодительскогоФЗ
        |
        |УПОРЯДОЧИТЬ ПО
        |	ВременнаяМеткаНачало,
        |	ИдентификаторРодительскогоФЗ";
        
    Запрос.УстановитьПараметр("ТекущееВремяВМиллисекундах", ТекущаяУниверсальнаяДатаВМиллисекундах());      
    Запрос.УстановитьПараметр("ОтключитьОтборПоНачалу", Не ЗначениеЗаполнено(НачалоПериода));
    Запрос.УстановитьПараметр("ОтключитьОтборПоОкончанию", Не ЗначениеЗаполнено(КонецПериода));
    Запрос.УстановитьПараметр("МеткаНачала", ум_ПакетыДанныхОбщегоНазначения.ДатаВМеткуВремениUTC(НачалоПериода));
    Запрос.УстановитьПараметр("МеткаОкончания", ум_ПакетыДанныхОбщегоНазначения.ДатаВМеткуВремениUTC(КонецДня(КонецПериода)));
    Запрос.УстановитьПараметр("ОтключитьОтборПоСпособу", Не ЗначениеЗаполнено(СпособОбработки));
    Запрос.УстановитьПараметр("СпособОбработки", СпособОбработки);
    
    ДанныеДляДиаграммы = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляДиаграммы.Колонки.Добавить("ОбработаноПакетов",Новый ОписаниеТипов("Число",
										Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	Для Каждого СтрокаДиаграммы Из ДанныеДляДиаграммы Цикл 
		ДанныеСобытия = ум_ЛогированиеПакетыДанных.РазобратьДанныеСобытия(СтрокаДиаграммы.ДанныеСобытия);
		Если ТипЗнч(ДанныеСобытия) = Тип("Структура") И	ДанныеСобытия.Свойство("ОбработаноПакетов") Тогда
			СтрокаДиаграммы.ОбработаноПакетов = ДанныеСобытия.ОбработаноПакетов;		
		КонецЕсли;
	КонецЦикла;   
	
	ИтогиОбработаныхПакетов = ДанныеДляДиаграммы.Скопировать(,"ИдентификаторРодительскогоФЗ, ОбработаноПакетов");
	ИтогиОбработаныхПакетов.Свернуть("ИдентификаторРодительскогоФЗ", "ОбработаноПакетов");
	
	Для Каждого СтрокаДиаграммы Из ДанныеДляДиаграммы Цикл 
		Если СтрокаДиаграммы.ВидФЗ = Перечисления.ум_ВидыФЗПакетовДанных.УпровляющееФЗ Тогда
			НайденныеСтроки = ИтогиОбработаныхПакетов.НайтиСтроки(Новый Структура("ИдентификаторРодительскогоФЗ", СтрокаДиаграммы.КлючРабочегоПотока));
			Если НайденныеСтроки.Количество() Тогда
				СтрокаДиаграммы.ОбработаноПакетов = НайденныеСтроки[0].ОбработаноПакетов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ДанныеДляДиаграммы;
КонецФункции

&НаСервере
Процедура ОбновитьГраницыВремени(СтрокаДанных, МинДатаГанта, МаксДатаГанта, ДатаОкончания)
    
    Если МинДатаГанта = Неопределено Тогда
        МинДатаГанта = СтрокаДанных.ВременнаяМеткаНачало;
    Иначе
        МинДатаГанта = Мин(МинДатаГанта, СтрокаДанных.ВременнаяМеткаНачало);
    КонецЕсли;
    
    МаксДатаГанта = Макс(МаксДатаГанта, СтрокаДанных.ВременнаяМеткаКонец);
    
    ДатаОкончания = СтрокаДанных.ВременнаяМеткаКонец;
    Если СтрокаДанных.ВременнаяМеткаНачало = ДатаОкончания Тогда
        ДатаОкончания = СтрокаДанных.ВременнаяМеткаНачало + 1000;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьИлиСоздатьТочкуСпособа(Диаграмма, КэшСпособов, ИмяСпособа)
    
    ТочкаСпособ = КэшСпособов.Получить(ИмяСпособа);
    Если ТочкаСпособ = Неопределено Тогда
        ТочкаСпособ = Диаграмма.УстановитьТочку(ИмяСпособа,); 
        КэшСпособов.Вставить(ИмяСпособа, ТочкаСпособ);
    КонецЕсли;
    
    Возврат ТочкаСпособ;
    
КонецФункции

&НаСервере
Функция ОпределитьНомерДорожки(КэшОкончанийДорожек, СпособОбработки, ВременнаяМеткаНачало, ДатаОкончания)
    
    МассивОкончаний = КэшОкончанийДорожек.Получить(СпособОбработки);
    Если МассивОкончаний = Неопределено Тогда
        МассивОкончаний = Новый Массив;
        КэшОкончанийДорожек.Вставить(СпособОбработки, МассивОкончаний);
    КонецЕсли;
    
    Для Индекс = 0 По МассивОкончаний.ВГраница() Цикл
        Если МассивОкончаний[Индекс] <= ВременнаяМеткаНачало Тогда
            МассивОкончаний[Индекс] = ДатаОкончания;
            Возврат Индекс + 1;
        КонецЕсли;
    КонецЦикла;
    
    МассивОкончаний.Добавить(ДатаОкончания);
    Возврат МассивОкончаний.Количество();
    
КонецФункции

&НаСервере
Процедура ДобавитьИнтервалДиаграммы(Диаграмма, Точка, Серия, МеткаНачала, МеткаОкончания, Цвет = Неопределено, Текст = "")
    
    ЗначениеГанта = Диаграмма.ПолучитьЗначение(Точка, Серия); 
	Если Серия.Значение = "Управляющее ФЗ" Тогда
		ЗначениеГанта.Текст = Точка.Текст;
	Иначе
		ЗначениеГанта.Текст = "Поток " + Серия.Текст;
	КонецЕсли;
    Интервал = ЗначениеГанта.Добавить();
    Интервал.Начало = ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МеткаНачала);
    Интервал.Конец  = ум_ПакетыДанныхОбщегоНазначения.МеткаВремениВДатуUTC(МеткаОкончания);
    
    Если Цвет <> Неопределено Тогда
        Интервал.Цвет = Цвет;
    КонецЕсли;
    
    Если Не ПустаяСтрока(Текст) Тогда
        Интервал.Текст = Текст;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
